<script setup lang="ts">
import { useModal } from "@/hooks/useModal";

import ModalWrapper from "../../ModalWrapper/ModalWrapper.vue";

const isShowRuleModal = defineModel("show", {
  default: false,
});

const isAcceptRules = defineModel("accept", {
  default: false,
});

const emit = defineEmits(["close"]);

const { closeModal } = useModal(emit);

const handleAccept = () => {
  isAcceptRules.value = true;
  closeModal({ force: true });
};

const handleDecline = () => {
  isShowRuleModal.value = false;
  isAcceptRules.value = false;
  closeModal({ force: true });
};
</script>

<template>
  <ModalWrapper header="Согласие на обработку персональных данных" @close="closeModal">
    <div class="rules-modal">
      <div>
        Настоящим в соответствии с Федеральным законом № 152-ФЗ «О персональных данных» от 27.07.2006 года свободно,
        своей волей и в своем интересе выражаю свое безусловное согласие на обработку моих персональных данных ,
        зарегистрированным в соответствии с законодательством РФ по адресу: (далее по тексту - Оператор).
      </div>

      <div>
        1. Согласие дается на обработку одной, нескольких или всех категорий персональных данных, не являющихся
        специальными или биометрическими, предоставляемых мною, которые могут включать:
      </div>

      <div class="rules-modal__list">
        <div>- ФИО</div>
        <div>- Телефон</div>
        <div>- Email</div>
        <div>- Статус заявителя</div>
        <div>- Направления консультирования</div>
        <div>- Регион получателя услуги</div>
        <div>- Пол ребенка</div>
        <div>- Возраст ребенка</div>
        <div>- Задайте свой вопрос</div>
      </div>

      <div>
        2. Оператор может совершать следующие действия: сбор; запись; систематизация; накопление; хранение; уточнение
        (обновление, изменение); извлечение; использование; блокирование; удаление; уничтожение.
      </div>

      <div>3. Способы обработки: как с использованием средств автоматизации, так и без их использования.</div>

      <div>
        4. Цель обработки: предоставление мне услуг/работ, включая, направление в мой адрес уведомлений, касающихся
        предоставляемых услуг/работ, подготовка и направление ответов на мои запросы, направление в мой адрес информации
        о мероприятиях/товарах/услугах/работах Оператора.
      </div>

      <div>
        5. В связи с тем, что Оператор может осуществлять обработку моих персональных данных посредством программы для
        ЭВМ «1С-Битрикс24», я даю свое согласие Оператору на осуществление соответствующего поручения ООО «1С-Битрикс»,
        (ОГРН 5077746476209), зарегистрированному по адресу: 109544, г. Москва, б-р Энтузиастов, д. 2, эт.13, пом. 8-19.
      </div>

      <div>
        6. Настоящее согласие действует до момента его отзыва путем направления соответствующего уведомления на
        электронный адрес vssput@gmail.com или направления по адресу .
      </div>

      <div>
        7. В случае отзыва мною согласия на обработку персональных данных Оператор вправе продолжить обработку
        персональных данных без моего согласия при наличии оснований, предусмотренных Федеральным законом №152-ФЗ «О
        персональных данных» от 27.07.2006 г.
      </div>

      <div>
        <q-btn label="Принимаю" color="primary" @click="handleAccept()" />
        <q-btn
          label="Не принимаю"
          class="q-ml-sm q-btn--form"
          flat
          :ripple="false"
          color="grey-1"
          @click="handleDecline()" />
      </div>
    </div>
  </ModalWrapper>
</template>

<style lang="scss" scoped>
.rules-modal {
  display: flex;
  flex-direction: column;
  gap: 20px;

  &__list {
    padding: 0 50px;
  }
}
</style>
